benchmarks/v2-epoll/ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /
Document Length:        31425 bytes

Concurrency Level:      100
Time taken for tests:   20.135 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      32512000 bytes
HTML transferred:       31425000 bytes
Requests per second:    49.66 [#/sec] (mean)
Time per request:       2013.506 [ms] (mean)
Time per request:       20.135 [ms] (mean, across all concurrent requests)
Transfer rate:          1576.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.1      0       8
Processing:   252 1726 569.1   1627    3491
Waiting:      242 1681 556.0   1589    3369
Total:        252 1727 568.6   1628    3491

Percentage of the requests served within a certain time (ms)
  50%   1628
  66%   1814
  75%   2009
  80%   2099
  90%   2464
  95%   2952
  98%   3361
  99%   3490
 100%   3491 (longest request)